# Personal data analysis on marital status, existing loans, education, profession etc. and its impact on the campaign’s success.

In [138]:
#Loading modules
import pandas as pd # Data processing 
import numpy as np #Numerical Python
import matplotlib.pyplot as plt # Data visualisation
import seaborn as sns # Data visualisation

In [139]:
#Uploading main data file
customer_details=pd.read_csv("Customer_and_bank details_p1.csv")

In [141]:
customer_details.head()

,Customer_id,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code
0,1,56,services,married,high.school,no,no,yes,3,S1,C1
1,2,45,services,married,basic.9y,unknown,no,no,3,S1,C1
2,3,59,admin.,married,professional.course,no,no,no,4,S2,C2
3,4,41,blue-collar,married,unknown,unknown,no,no,3,S3,C3
4,5,24,technician,single,professional.course,no,yes,no,3,S3,C3

In [142]:
#creating a new column - age category based on the age distribution
customer_details['age_category']=customer_details['age'].apply(lambda x:'Teenagers' if x<20 else('Twenties' if 20<x<30  else ('Thirties' if 30<x<40 else ('Forties' if 40<x<50  else ('Fifties' if 50<x<60 else 'Retired')))))

In [143]:
customer_details['age_category'].value_counts()

Thirties     13728
Forties       8417
Fifties       5405
Twenties      4958
Retired       4508
Teenagers       68
Name: age_category, dtype: int64

### Our database of customers comprises of people in the age group of 30 to 40 years mostly

In [144]:
customer_details.describe()

        Customer_id           age
count  37084.000000  37084.000000
mean   18542.500000     40.042714
std    10705.373028     10.432965
min        1.000000     17.000000
25%     9271.750000     32.000000
50%    18542.500000     38.000000
75%    27813.250000     47.000000
max    37084.000000     98.000000

In [145]:
#Uploading the target dataset
customer_response=pd.read_csv("Customer_Response_data_p1.csv")

In [146]:
customer_response.head()

   Customer_id   y
0            1  no
1            2  no
2            3  no
3            4  no
4            5  no

In [147]:
#Joining tables of recorded customer data and whether the customer has subscribed or not
cust_data=pd.merge(customer_details,customer_response,on='Customer_id',how='inner')
cust_data.head()

,Customer_id,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code,age_category,y
0,1,56,services,married,high.school,no,no,yes,3,S1,C1,Fifties,no
1,2,45,services,married,basic.9y,unknown,no,no,3,S1,C1,Forties,no
2,3,59,admin.,married,professional.course,no,no,no,4,S2,C2,Fifties,no
3,4,41,blue-collar,married,unknown,unknown,no,no,3,S3,C3,Forties,no
4,5,24,technician,single,professional.course,no,yes,no,3,S3,C3,Twenties,no

In [148]:
#Columns data
cust_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 37084 entries, 0 to 37083
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Customer_id   37084 non-null  int64
 1   age           37084 non-null  int64
 2   job           37084 non-null  object
 3   marital       37084 non-null  object
 4   education     37084 non-null  object
 5   default       37084 non-null  object
 6   housing       37084 non-null  object
 7   loan          37084 non-null  object
 8   Region_Code   37084 non-null  object
 9   State_Code    37084 non-null  object
 10  City_Code     37084 non-null  object
 11  age_category  37084 non-null  object
 12  y             37084 non-null  object
dtypes: int64(2), object(11)
memory usage: 4.0+ MB

In [149]:
cust_data.isnull().sum()

Customer_id     0
age             0
job             0
marital         0
education       0
default         0
housing         0
loan            0
Region_Code     0
State_Code      0
City_Code       0
age_category    0
y               0
dtype: int64

### There is no null data in the dataset

In [150]:
cust_data.isna().sum()

Customer_id     0
age             0
job             0
marital         0
education       0
default         0
housing         0
loan            0
Region_Code     0
State_Code      0
City_Code       0
age_category    0
y               0
dtype: int64

In [164]:
#Average subscribing rate of our dataset
cust_data['y'].value_counts()['yes']/(cust_data['y'].value_counts()['yes']+cust_data['y'].value_counts()['no'])*100

11.34721173551936

In [151]:
#Marital values also have 72 unknown values
cust_data['marital'].value_counts()

married     22479
single      10407
divorced     4126
unknown        72
Name: marital, dtype: int64

In [152]:
cust_data[cust_data['marital']=='unknown']

,Customer_id,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code,age_category,y
33,34,58,management,unknown,university.degree,no,yes,no,2,S10,C11,Fifties,no
346,347,59,retired,unknown,university.degree,unknown,no,no,2,S32,C91,Fifties,no
367,368,57,retired,unknown,basic.4y,no,no,no,2,S30,C92,Fifties,no
1334,1335,33,services,unknown,high.school,no,yes,yes,4,S2,C2,Thirties,no
1435,1436,32,unknown,unknown,university.degree,no,no,no,2,S25,C216,Thirties,yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...
34699,34700,31,entrepreneur,unknown,university.degree,no,no,no,2,S40,C249,Thirties,yes
34726,34727,31,entrepreneur,unknown,university.degree,no,yes,no,1,S12,C31,Thirties,no
35393,35394,30,technician,unknown,university.degree,no,no,no,4,S28,C442,Retired,yes
35394,35395,30,technician,unknown,university.degree,no,no,no,4,S28,C442,Retired,yes
36791,36792,30,technician,unknown,university.degree,no,no,no,2,S10,C11,Retired,no

In [153]:
#Creating a pivot table
marital_status=pd.pivot_table(data=cust_data,index=['marital'],columns=['y'],values=['Customer_id'],aggfunc='count',margins=True, margins_name='Total')
marital_status

         Customer_id
y                 no   yes  Total
marital
divorced        3699   427   4126
married        20187  2292  22479
single          8930  1477  10407
unknown           60    12     72
Total          32876  4208  37084

In [159]:
'''plt.style.use('dark_background')
plt.figure(figsize=(20, 6))
plt.title('Marital Status  of our subscribers')
plt.bar(marital_status['marital'],cust_data['y'])
#plt.xticks(rotation=45)
#plt.ylabel('in millions')
#plt.grid(True, 'major', linestyle='--', c='grey')
plt.show()'''

"plt.style.use('dark_background')\nplt.figure(figsize=(20, 6))\nplt.title('Marital Status  of our subscribers')\nplt.bar(marital_status['marital'],cust_data['y'])\n#plt.xticks(rotation=45)\n#plt.ylabel('in millions')\n#plt.grid(True, 'major', linestyle='--', c='grey')\nplt.show()"

In [93]:
#Calculating the success rate acheived
marital_status['Success Rate']=(marital_status['Customer_id']['yes']/marital_status['Customer_id']['Total'])*100
marital_status.sort_values(by='Success Rate',ascending=False,inplace=True)

In [94]:
marital_status

         Customer_id              Success Rate
y                 no   yes  Total
marital
unknown           60    12     72    16.666667
single          8930  1477  10407    14.192371
Total          32876  4208  37084    11.347212
divorced        3699   427   4126    10.349006
married        20187  2292  22479    10.196183

In [92]:
loan_status=pd.pivot_table(data=cust_data,index=['loan'],columns=['y'],values=['Customer_id'],aggfunc='count',margins=True, margins_name='Total')
loan_status['Success Rate']=(loan_status['Customer_id']['yes']/loan_status['Customer_id']['Total'])*100
loan_status.sort_values(by='Success Rate',ascending=False,inplace=True)
loan_status

        Customer_id              Success Rate
y                no   yes  Total
loan
no            27062  3499  30561    11.449233
Total         32876  4208  37084    11.347212
yes            5023   618   5641    10.955504
unknown         791    91    882    10.317460

In [90]:
education_status=pd.pivot_table(data=cust_data,index=['education'],columns=['y'],values=['Customer_id'],aggfunc='count',margins=True, margins_name='Total')
education_status['Success Rate']=(education_status['Customer_id']['yes']/education_status['Customer_id']['Total'])*100
education_status.sort_values(by='Success Rate',ascending=False,inplace=True)
education_status

                    Customer_id              Success Rate
y                            no   yes  Total
education
unknown                    1318   231   1549    14.912847
university.degree          9464  1507  10971    13.736214
illiterate                   14     2     16    12.500000
professional.course        4205   541   4746    11.399073
Total                     32876  4208  37084    11.347212
high.school                7597   945   8542    11.062983
basic.4y                   3374   391   3765    10.385126
basic.6y                   1903   171   2074     8.244937
basic.9y                   5001   420   5421     7.747648

In [89]:
job_status=pd.pivot_table(data=cust_data,index=['job'],columns=['y'],values=['Customer_id'],aggfunc='count',margins=True, margins_name='Total')
job_status['Success Rate']=(job_status['Customer_id']['yes']/job_status['Customer_id']['Total'])*100
job_status.sort_values(by='Success Rate',ascending=False,inplace=True)
job_status

              Customer_id              Success Rate
y                      no   yes  Total
job
student               527   240    767    31.290743
retired              1146   395   1541    25.632706
unemployed            791   134    925    14.486486
admin.               8174  1246   9420    13.227176
unknown               271    35    306    11.437908
Total               32876  4208  37084    11.347212
management           2345   292   2637    11.073189
technician           5439   657   6096    10.777559
self-employed        1145   131   1276    10.266458
housemaid             853    93    946     9.830867
entrepreneur         1198   111   1309     8.479756
services             3249   298   3547     8.401466
blue-collar          7738   576   8314     6.928073

In [95]:
housing_status=pd.pivot_table(data=cust_data,index=['housing'],columns=['y'],values=['Customer_id'],aggfunc='count',margins=True, margins_name='Total')
housing_status['Success Rate']=(housing_status['Customer_id']['yes']/housing_status['Customer_id']['Total'])*100
housing_status.sort_values(by='Success Rate',ascending=False,inplace=True)
housing_status

        Customer_id              Success Rate
y                no   yes  Total
housing
yes           17154  2279  19433    11.727474
Total         32876  4208  37084    11.347212
no            14931  1838  16769    10.960701
unknown         791    91    882    10.317460

In [96]:
housing_status=pd.pivot_table(data=cust_data,index=['housing'],columns=['y'],values=['Customer_id'],aggfunc='count',margins=True, margins_name='Total')
housing_status['Success Rate']=(housing_status['Customer_id']['yes']/housing_status['Customer_id']['Total'])*100
housing_status.sort_values(by='Success Rate',ascending=False,inplace=True)
housing_status

        Customer_id              Success Rate
y                no   yes  Total
housing
yes           17154  2279  19433    11.727474
Total         32876  4208  37084    11.347212
no            14931  1838  16769    10.960701
unknown         791    91    882    10.317460

In [97]:
default_status=pd.pivot_table(data=cust_data,index=['housing'],columns=['y'],values=['Customer_id'],aggfunc='count',margins=True, margins_name='Total')
default_status['Success Rate']=(default_status['Customer_id']['yes']/default_status['Customer_id']['Total'])*100
default_status.sort_values(by='Success Rate',ascending=False,inplace=True)
default_status

        Customer_id              Success Rate
y                no   yes  Total
housing
yes           17154  2279  19433    11.727474
Total         32876  4208  37084    11.347212
no            14931  1838  16769    10.960701
unknown         791    91    882    10.317460

In [100]:
customer_details['age'].describe()

count    37084.000000
mean        40.042714
std         10.432965
min         17.000000
25%         32.000000
50%         38.000000
75%         47.000000
max         98.000000
Name: age, dtype: float64

In [124]:
age_category_status=pd.pivot_table(data=cust_data,index=['age_category'],columns=['y'],values=['Customer_id'],aggfunc='count',margins=True, margins_name='Total')
age_category_status['Success Rate']=(age_category_status['Customer_id']['yes']/age_category_status['Customer_id']['Total'])*100
age_category_status.sort_values(by='Success Rate',ascending=False,inplace=True)
age_category_status

             Customer_id              Success Rate
y                     no   yes  Total
age_category
Teenagers             39    29     68    42.647059
Retired             3716   792   4508    17.568767
Twenties            4171   787   4958    15.873336
Total              32876  4208  37084    11.347212
Fifties             4853   552   5405    10.212766
Thirties           12361  1367  13728     9.957751
Forties             7736   681   8417     8.090769

In [183]:
(cust_data[(cust_data['age_category']=='Twenties') & (cust_data['job']=='admin.')]['y'].value_counts()['yes'])/(cust_data[(cust_data['age_category']=='Twenties') & (cust_data['job']=='admin.')]['y'].value_counts()['yes']+cust_data[(cust_data['age_category']=='Twenties') & (cust_data['job']=='admin.')]['y'].value_counts()['no'])*100

18.707015130674005

In [178]:
list_age_category=cust_data['age_category'].unique()

In [180]:
type(list_age_category)

numpy.ndarray

In [184]:
list_age_category

['Fifties', 'Forties', 'Twenties', 'Thirties', 'Retired', 'Teenagers']

list_age_category=list(list_age_category)

In [182]:
type(list_age_category)

list

In [190]:
list_job_category=cust_data['job'].unique()

In [191]:
list_job_category=list(list_job_category)

In [192]:
type(list_age_category)

list

In [197]:
list_age_category

['Fifties', 'Forties', 'Twenties', 'Thirties', 'Retired', 'Teenagers']

In [189]:
for item in list_age_category:
    print(item,":" ,(cust_data[(cust_data['age_category']==item) & (cust_data['job']=='admin.')]['y'].value_counts()['yes'])/(cust_data[(cust_data['age_category']==item) & (cust_data['job']=='admin.')]['y'].value_counts()['yes']+cust_data[(cust_data['age_category']==item) & (cust_data['job']=='admin.')]['y'].value_counts()['no'])*100)

Fifties : 13.727359389895138
Forties : 10.918367346938776
Twenties : 18.707015130674005
Thirties : 11.619095731245265
Retired : 15.631262525050099

KeyError: 'yes'

In [199]:
list_age_category.pop(5)

'Teenagers'

In [200]:
list_age_category

['Fifties', 'Forties', 'Twenties', 'Thirties', 'Retired']

In [220]:
list_high_success_rates=[]
for occupation in list_job_category:
    for item in list_age_category:
        try:
            Success=((cust_data[(cust_data['age_category']==item) & (cust_data['job']==occupation)]['y'].value_counts()['yes'])/(cust_data[(cust_data['age_category']==item) & (cust_data['job']==occupation)]['y'].value_counts()['yes']+cust_data[(cust_data['age_category']==item) & (cust_data['job']==occupation)]['y'].value_counts()['no'])*100 )
            if Success>15.0:
                print(occupation,"and the age is", item ," : ", Success)
        except KeyError:
            print("No yes value found")

admin. and the age is Twenties  :  18.707015130674005
admin. and the age is Retired  :  15.631262525050099
housemaid and the age is Retired  :  25.757575757575758
No yes value found
retired and the age is Retired  :  42.65927977839335
management and the age is Retired  :  15.824915824915825
unknown and the age is Twenties  :  40.909090909090914
unknown and the age is Retired  :  19.148936170212767
unemployed and the age is Fifties  :  17.293233082706767
unemployed and the age is Twenties  :  22.400000000000002
unemployed and the age is Retired  :  15.11627906976744
No yes value found
student and the age is Forties  :  33.33333333333333
student and the age is Twenties  :  30.879345603271986
student and the age is Thirties  :  22.807017543859647
student and the age is Retired  :  35.55555555555556

In [221]:
list_education=cust_data['education'].unique()

In [222]:
list_education=list(list_education)

In [223]:
list_education

['high.school',
 'basic.9y',
 'professional.course',
 'unknown',
 'basic.4y',
 'basic.6y',
 'university.degree',
 'illiterate']

In [224]:
list_marital=cust_data['marital'].unique()

In [225]:
list_marital=list(list_marital)

In [226]:
list_marital

['married', 'single', 'divorced', 'unknown']

In [227]:
list_marital.pop(3)

'unknown'

In [228]:
list_marital

['married', 'single', 'divorced']

In [233]:
list_high_success_rates=[]
for education in list_education:
    for marital in list_marital:
        try:
            Success=((cust_data[(cust_data['education']==education) & (cust_data['marital']==marital)]['y'].value_counts()['yes'])/(cust_data[(cust_data['education']==education) & (cust_data['marital']==marital)]['y'].value_counts()['yes']+cust_data[(cust_data['education']==education) & (cust_data['marital']==marital)]['y'].value_counts()['no'])*100 )
            if Success>13.0:
                print(education,"and the marital status is", marital ," : ", Success)
        except KeyError:
            print()

high.school and the marital status is single  :  14.520156974669995
unknown and the marital status is single  :  21.379310344827587
basic.4y and the marital status is divorced  :  17.674418604651162
university.degree and the marital status is single  :  15.797430083144368
illiterate and the marital status is married  :  14.285714285714285